Autodesk.Revit.UI.Events.OptimizeAnnotationsEditModeExitedEventArgs.Cancelled
True when the edit mode was cancelled, false when the edit mode was finished.

Autodesk.Revit.UI.Events.OptimizeAnnotationsEditModeExitedEventArgs.ActiveViewId
The id of the active view when the edit mode was exited.

Autodesk.Revit.UI.Events.OptimizeAnnotationsEditModeExitedEventArgs
The event arguments used by the OptimizeAnnotationsEditModeExitedEventArgs event.